{
  "url": "https://blog.dailydoseofds.com/p/5-agentic-ai-design-patterns",
  "type": "webpage",
  "content": "      5 Agentic AI Design Patterns - by Avi Chawla                                                           \n \n \n Daily Dose of Data Science \n \n \n Subscribe Sign in \n \n \n \n \n \n \n \n 5 Agentic AI Design Patterns \n ...explained visually \n \n \n \n \n \n Avi Chawla \n Jan 23, 2025 \n \n \n \n \n 62 \n \n 1 \n 5 \n \n Share \n \n \n \n \n \n Web scraping in pure English with Firecrawl Extract \n \n \n \n With simple English prompts, you can now effortlessly extract clean, structured data from the web. \n Firecrawl Extract does this as follows: \n \n \n \n \n Provide the website URL and specify what you want to extract as a prompt. \n \n FireCrawl Extract automatically generates the request parameters and a schema (all editable). \n \n Click “Run” and get clean, structured data in seconds. \n \n In the above image, I asked it to extract the authors of this newsletter, and it returned the correct output—Avi Chawla and Akshay Pachaar. \n FireCrawl also generates code snippets to run the same job programmatically. \n Start scrapping with FireCrawl \n Thanks to FireCrawl for showing us their powerful scraping capabilities and partnering today! \n \n 5 Agentic AI Design Patterns \n \n \n \n Agentic behaviors allow LLMs to refine their output by incorporating self-evaluation, planning, and collaboration! \n The following visual depicts the 5 most popular design patterns employed in building AI agents. \n \n \n \n \n Let's understand them below! \n On a side note, we started a beginner-friendly crash course on RAGs recently with implementations, which covers: \n ​​ RAG fundamentals ​​ ​​​ \n \n ​ RAG evaluation ​ \n \n ​​​ ​​ RAG optimization ​​ ​​​ \n \n ​ Multimodal RAG ​ \n \n ​​​ ​​ Graph RAG ​​ \n \n ​​ Multivector retrieval using ColBERT ​ \n \n ​​​ ​​ RAG over complex real word docs ft. ColPali ​ \n \n \n 1) Reflection pattern \n \n \n \n \n \n \n \n The AI reviews its work to spot mistakes and iterate until it produces the final response. \n 2) Tool use pattern \n \n \n \n \n \n \n \n Tools allow LLMs to gather more information by: \n Querying a vector database \n \n Executing Python scripts \n \n Invoking APIs, etc. \n \n This is helpful since the LLM is not solely reliant on its internal knowledge. \n 3) ReAct (Reason and Act) pattern \n \n \n \n \n \n \n \n ReAct combines the above two patterns: \n The Agent can reflect on the generated outputs. \n \n It can interact with the world using tools. \n \n This makes it one of the most powerful patterns used today. \n 4) Planning pattern \n \n \n \n \n \n \n \n Instead of solving a request in one go, the AI creates a roadmap by: \n Subdividing tasks \n \n Outlining objectives \n \n This strategic thinking can solve tasks more effectively. \n 5) Multi-agent pattern \n \n \n \n \n \n \n \n In this setup: \n We have several agents. \n \n Each Agent is assigned a dedicated role and task. \n \n Each Agent can also access tools. \n \n All agents work together to deliver the final outcome while delegating tasks to other agents if needed. \n \n We'll soon dive deep into each of these patterns, showcasing real-world use cases and code implementations. \n In the meantime, make sure you are fully equipped with everything we have covered so far like: \n ​ RAG fundamentals ​ \n \n ​ RAG evaluation ​ \n \n ​ RAG optimization ​ \n \n ​ Multimodal RAG ​ \n \n ​ Graph RAG ​ \n \n ​ Multivector retrieval using ColBERT ​ \n \n ​ RAG over complex real word docs ft. ColPali ​ \n \n Thanks for reading Daily Dose of Data Science! Subscribe below and receive a free data science PDF (530+ pages) with 150+ core data science and machine learning lessons. \n \n \n \n Subscribe \n \n \n \n \n \n \n \n P.S. For those wanting to develop “Industry ML” expertise: \n \n \n \n \n \n \n \n At the end of the day, all businesses care about impact . That’s it! \n Can you reduce costs? \n \n Drive revenue? \n \n Can you scale ML models? \n \n Predict trends before they happen? \n \n We have discussed several other topics (with implementations) in the past that align with such topics. \n Develop \"Industry ML\" Skills \n Here are some of them: \n Learn sophisticated graph architectures and how to train them on graph data: A Crash Course on Graph Neural Networks – Part 1 . \n \n So many real-world NLP systems rely on pairwise context scoring. Learn scalable approaches here: Bi-encoders and Cross-encoders for Sentence Pair Similarity Scoring – Part 1 . \n \n Learn techniques to run large models on small devices: Quantization: Optimize ML Models to Run Them on Tiny Hardware . \n \n Learn how to generate prediction intervals or sets with strong statistical guarantees for increasing trust: Conformal Predictions: Build Confidence in Your ML Model’s Predictions . \n \n Learn how to identify causal relationships and answer business questions: A Crash Course on Causality – Part 1 \n \n Learn how to scale ML model training: A Practical Guide to Scaling ML Model Training . \n \n Learn techniques to reliably roll out new models in production: 5 Must-Know Ways to Test ML Models in Production (Implementation Included) \n \n Learn how to build privacy-first ML systems: Federated Learning: A Critical Step Towards Privacy-Preserving Machine Learning . \n \n Learn how to compress ML models and reduce costs: Model Compression: A Critical Step Towards Efficient Machine Learning . \n \n All these resources will help you cultivate key skills that businesses and companies care about the most. \n \n \n \n 62 \n \n 1 \n 5 \n \n Share \n \n \n \n Previous Next \n \n \n \n \n \n \n Discussion about this post \n Comments Restacks \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n alex flow  \n Feb 8, 2025 \n \n \n \n \n \n This is amazing, what tool did you use to make such nice charts? \n Expand full comment \n \n \n Reply \n \n Share \n \n \n \n \n \n \n \n \n \n \n \n \n Top Latest Discussions \n \n \n \n \n \n \n \n \n No posts \n \n \n \n \n \n \n Ready for more? \n \n \n Subscribe \n \n \n \n \n \n \n \n \n \n © 2026 Avi Chawla · Privacy ∙ Terms ∙ Collection notice \n Start your Substack Get the app \n Substack is the home for great culture \n \n \n \n \n \n \n  \n                                                                                                                                                                                                 This site requires JavaScript to run correctly. Please turn on JavaScript or unblock scripts \n    ",
  "title": "5 Agentic AI Design Patterns - by Avi Chawla",
  "content_type": "text/html; charset=utf-8"
}