{
  "url": "https://evilmartians.com/chronicles/debug-ai-fast-agent-prism-open-source-library-visualize-agent-traces",
  "type": "webpage",
  "content": "Debug AI fast with this open source library to visualize agent traces—Martian Chronicles, Evil Martians’ team blog \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Hire Martians \n \n \n \n \n \n \n \n \n \n \n Debug AI fast with this open source library to visualize agent traces \n October 15, 2025 \n \n \n \n Topics \n AI \n AI integration \n \n \n \n \n Gleb Stroganov \n Product Designer \n \n \n \n \n \n Travis Turner \n Tech Editor \n \n \n \n AI agents fail silently, loop endlessly, skip steps, and give wrong answers. If you’re debugging them by parsing JSON logs at midnight, you’re suffering needlessly. At Evil Martians, we’ve built enough AI agents to intimately know this pain: 4-hour debugging sessions hunting through nested JSON for a loop that should be obvious. When Quotient AI , a Boston startup building production agent reliability tools, hit the same wall, we partnered with them to solve it. \n \n  Martian project team \n \n \n \n \n Gleb Stroganov \n Product Designer \n \n \n \n \n \n Yuri Mikhin \n Frontend Engineer \n \n \n \n \n \n Ivan Eltsov \n Frontend Engineer \n \n \n \n \n \n Kirill Yakovenko \n Account Manager \n \n \n  We built AgentPrism , an open source React component library that cuts debugging time from hours to seconds. Quotient uses it in production , and now you can, too. \n   The tooling problem \n  Here’s a scenario: Deanna from Quotient AI is an AI Researcher who isn’t new to debugging agents. She’s evaluating a new multi-agent system where one agent plans and others execute. Somewhere in the chain, a sub-agent keeps calling the wrong tool. The trace should explain everything: the messages, tool calls, and retries. \n  Quotient \n \n \n See also \n \n \n \n  The only problem? The answer is buried within a terrible wall of JSON logs, and it’s impossible to see the flow . \n  This isn’t a one-off situation; it’s something that’s happening to AI developers every day. AI solutions (like LangChain, Mastra, OpenAI Agents, AI SDK, and Quotient) are pressured from enterprise customers to provide bullet-proof debugging and monitoring. \n  But observability for LLM-driven agents hasn’t caught up yet . Current pains : \n   Manual log-scrubbing stretches incidents from minutes to hours \n  Redundant model calls and mis-sequenced API hits burn $500–2,000 per failure \n  Unexplained agent behavior erodes trust with users and regulators \n   Of course, we didn’t just see this, we also experienced this pain ourselves, and we knew we couldn’t be alone. The struggle was real! \n  Something clicks \n  We introduced OpenTelemetry observation and started tracking all steps systematically. Suddenly, we saw those loops forming, understood why they were happening, and could fix them in minutes. \n  With that, 4 hours of manual JSON parsing became 30 seconds of visual inspection! \n  \n \n \n \n Hire Evil Martians \n AgentPrism is another step towards agent reliability. Let’s put AI to work for your product. \n Book a call \n  The insight : human brains excel at visual pattern recognition. This means that loops invisible in JSON become glaringly clear when made visual. Thus, fixing cost spikes that require manual calculation becomes essentially instant. \n  UI for Quotient AI: the developer tool for prompt engineers \n \n \n \n \n \n Read also \n \n \n \n  We researched almost all existing observability solutions and tried them ourselves. Great tools, but we realized they solve different parts of the same problem. We decided to combine the best in one place. \n  Instead of choosing between multiple complex tools, we’re bringing the essential features together: LLM insights + trace structure + visualization = drop-in React components \n  So, we built React components that transform raw OpenTelemetry trace data into interactive visualizations. \n  A look at AgentPrism \n  The result? Engineers get enterprise-grade observability without leaving their IDE or dealing with complex dashboards. \n  We conducted a round of design-engineering exploration and selected the best 4 out of 12 components. We chose these 4 because they directly address the core debugging workflow. \n  Tree View displays the hierarchical trace structure \n   Shows parent-child relationships between agent steps \n  Red highlighting for problematic patterns \n  Collapsed summary for repetitive sequences \n   We found that engineers wanted hierarchy above all and Tree View was the most effective since progressive disclosure keeps deep structures navigable and minimizes on-screen noise and navigation cost. (Tree View appears on the left in the image just below.) \n  Timeline View shows a Gantt-style execution flow \n  Timeline View quickly points to where time and money are being wasted. \n   Reveals concurrency issues and bottlenecks \n  Color-coded status indicators (green = success, red = error, yellow = warning) \n  Real-time cost accumulation with dollar amounts \n   \n \n \n \n Tree View on the left, Timeline on the right \n  The Details Panel displays a compressed span of information \n  This panel gives engineers necessary context, without overwhelming detail. \n   Input/output data for each step \n  Cost breakdown and performance metrics \n  All relevant attributes in one view \n   \n \n \n \n  The Sequence Diagram shows a step-by-step replay \n  The Sequence Diagram is ideal for onboarding users and introducing the concept of agent traces. It’s also good for debugging complex flows. \n  Additionally, when you play/pause an agent run, you can observe how the agent is working in real-time. \n   Perfect for understanding decision chains \n  Visual flow of prompts and responses \n  Easy identification of circular logic \n   \n \n \n \n  The impact for real users \n  Every extra click outside my IDE kills context. Now I can see the loop pattern immediately—no more parsing JSON for hours. \n \n \n \n \n \n \n Freddie Vargus \n Co-founder & CTO, Quotient AI \n \n \n \n  The visual timeline showed me exactly where users were dropping off. What took 4 hours before now takes 10 minutes. \n \n \n \n \n \n \n Julia Neagu \n Co-founder & CEO, Quotient AI \n \n \n \n  \n \n \n \n  AgentPrism: technical implementation \n   Monorepo: pnpm + TypeScript + React + Vite. Core is split for clean boundaries and distribution. \n  UI (TreeView, SpanCard): accessible (Radix/ARIA), strongly typed, themeable, layout-flexible. \n  Data (services): converts OTLP/OpenTelemetry into a compact UI schema; local types aligned to the spec. \n  Distribution: UI components as copyable source (shadcn-style); Data converters as npm packages. \n  Integration: import components + converter; render traces in minutes without external dashboards. \n   \n \n \n \n  Get started now \n  We’re open sourcing this because the entire AI ecosystem needs better debugging tools. \n  Our components work with any OpenTelemetry-compatible data, ensuring broad compatibility without vendor lock-in. The value of AgentPrism is clear: \n   Instant pattern recognition vs. sequential analysis \n  80% reduction in debugging time and 60% reduction in memory usage \n  Real-time cost monitoring and alerts \n  No external dashboard context switching \n  Industry-standard OpenTelemetry foundation \n  Drop-in simplicity vs. complex enterprise tools \n  IDE-native experience vs. external dashboards \n    AI founders will love AgentPrism because it allows shipping reliable products 5× faster with visual debugging workflows. \n  Storybook \n \n  Developers will love AgentPrism because these are drop-in React components that integrate with your existing stack. \n  AgentPrism on GitHub \n \n  Product designers will love AgentPrism because they can pick up these battle-tested components instead of running months of UI exploration. \n  Figma Kit \n \n  \n  We’re looking for more design partners to validate our approach and shape future features. Here are some ways to get involved: \n   Let’s talk about how you can leverage this tool for your startup \n  Join our early adopter program and get priority access to new features \n  Contribute to the open source project and help shape the ecosystem \n  \n \n \n \n \n Irina Nazarova  CEO at Evil Martians \n AgentPrism is another step towards agent reliability. Let’s put AI to work for your product. \n Book a call Send email instead \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n  ",
  "title": "Debug AI fast with this open source library to visualize agent traces—Martian Chronicles, Evil Martians’ team blog",
  "content_type": "text/html; charset=UTF-8"
}